In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.76,-4.3]],
                 index = list('abcd'),
                 columns = ['one','two'])

In [4]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.76 -4.3

In [5]:
df.sum()

one    9.26
two   -8.80
dtype: float64

In [7]:
df.sum(axis = 'columns')

a    1.40
b    2.60
c    0.00
d   -3.54
dtype: float64

In [8]:
df.mean(axis='columns', skipna= False)

a     NaN
b    1.30
c     NaN
d   -1.77
dtype: float64

In [9]:
df.sum(axis = 'columns', skipna = False)

a     NaN
b    2.60
c     NaN
d   -3.54
dtype: float64

In [12]:
df.sum(axis = 'columns')

a    1.40
b    2.60
c    0.00
d   -3.54
dtype: float64

In [14]:
df.idxmax()

one    b
two    d
dtype: object

In [15]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.76 -4.3

In [16]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.26 -8.8

In [17]:
df.sum()

one    9.26
two   -8.80
dtype: float64

In [18]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.086667 -4.400000
std    3.490349  0.141421
min    0.760000 -4.500000
25%    1.080000 -4.450000
50%    1.400000 -4.400000
75%    4.250000 -4.350000
max    7.100000 -4.300000

In [19]:
df1 = pd.Series(['a','a','b','c'] * 4)

In [20]:
df1

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [21]:
df1.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [26]:
df1.count()

16

In [27]:
df1.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [28]:
df1.min()

'a'

In [29]:
df1.max()

'c'

In [36]:
df['one'].argmin()

3

In [37]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.76 -4.3

In [38]:
df['two'].argmax()

3

In [39]:
df['one'].idxmin()

'd'

In [40]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.76 -4.3

In [41]:
df['one'].quantile()

1.4

In [42]:
df['one'].quantile(q=0.25)

1.08

In [43]:
df['one'].quantile(q=0.33)

1.1824

In [44]:
df['one'].sum()

9.26

In [45]:
df['one'].mean()

3.0866666666666664

In [46]:
df['one'].median()

1.4

In [47]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.76 -4.3

In [48]:
df.mad()

one    2.675556
two    0.100000
dtype: float64

In [49]:
df.var()

one    12.182533
two     0.020000
dtype: float64

In [50]:
df['one'].var()

12.182533333333334

# Correlation and Covariance

In [52]:
import pandas_datareader.data as web

ModuleNotFoundError: No module named 'pandas_datareader'

# Unique Values, Value Counts, and Membership

In [2]:
import pandas as pd
obj = pd.Series(['a','b','c','a','a','d','c','b','a','c'])

In [3]:
obj

0    a
1    b
2    c
3    a
4    a
5    d
6    c
7    b
8    a
9    c
dtype: object

In [5]:
obj.unique()

array(['a', 'b', 'c', 'd'], dtype=object)

In [6]:
obj.value_counts()

a    4
c    3
b    2
d    1
dtype: int64

In [7]:
pd.value_counts(obj)

a    4
c    3
b    2
d    1
dtype: int64

In [8]:
pd.value_counts(obj, sort= False)

b    2
d    1
c    3
a    4
dtype: int64

In [10]:
mask = obj.isin(['b','c'])

In [11]:
mask

0    False
1     True
2     True
3    False
4    False
5    False
6     True
7     True
8    False
9     True
dtype: bool

In [12]:
obj[mask]

1    b
2    c
6    c
7    b
9    c
dtype: object

In [13]:
obj

0    a
1    b
2    c
3    a
4    a
5    d
6    c
7    b
8    a
9    c
dtype: object

In [14]:
obj_u = pd.Series(['a','b','c','d'])

In [15]:
obj_u

0    a
1    b
2    c
3    d
dtype: object

In [18]:
a = pd.Index(obj_u).get_indexer(obj)

In [19]:
a = a.astype(bool)

In [20]:
a

array([False,  True,  True, False, False,  True,  True,  True, False,
        True])

In [21]:
obj[a]

1    b
2    c
5    d
6    c
7    b
9    c
dtype: object

In [23]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],'Qu2': [2, 3, 1, 2, 3],'Qu3': [1, 5, 2, 4, 4]})

In [24]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [27]:
result = data.apply(pd.value_counts).fillna(0)

In [28]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0